&НаКлиенте
Процедура Обработать(Команда)

	ВсеДанные = ПолучитьВсеДанныеНаСервере();

	Если ВсеДанные.Данные1 = Неопределено Или ВсеДанные.Данные2 = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОповеститьОЗавершении(ВсеДанные.Данные1, ВсеДанные.Данные2, ВсеДанные.Данные3);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВсеДанныеНаСервере()

	Результат = Новый Структура;
	Результат.Вставить("Данные1", ПолучитьДанные1());
	Результат.Вставить("Данные2", ПолучитьДанные2());
	Результат.Вставить("Данные3", ПолучитьДанные3());

	Возврат Результат;

КонецФункции
