Процедура ЗаполнитьДанныеПоСтрокам(Знач Данные) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В (&СписокСсылок)";
	Запрос.УстановитьПараметр("СписокСсылок", Данные.ВыгрузитьКолонку("Ссылка"));
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		СтрокаДанных = Данные.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка))[0];
		СтрокаДанных.Наименование = Выборка.Наименование;
	КонецЦикла;

КонецПроцедуры
