Процедура ЗаполнитьДанныеПоСтрокам(Знач Данные) Экспорт

	// N обращений к БД вместо одного - запрос создается на каждой итерации.
	Для Каждого Строка Из Данные Цикл
		Запрос = Новый Запрос("ВЫБРАТЬ Контрагенты.Наименование КАК Наименование
		|ИЗ Справочник.Контрагенты КАК Контрагенты
		|ГДЕ Контрагенты.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Строка.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Строка.Наименование = Выборка.Наименование;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
