Процедура ПроверитьЗаполнение(Знач ДокументОбъект, Отказ) Экспорт

	Если Не ЗначениеЗаполнено(ДокументОбъект.Склад) Тогда
		Отказ = Истина;
		ЗаписьЖурналаРегистрации("Учет.ПроверкаЗаполнения", УровеньЖурналаРегистрации.Предупреждение, , , "Не заполнен склад");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		Отказ = Истина;
		ЗаписьЖурналаРегистрации("Учет.ПроверкаЗаполнения", УровеньЖурналаРегистрации.Предупреждение, , , "Не заполнен контрагент");
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры
