Функция ПолучитьЗаказыССуммамиОплат(Знач Запрос, Знач ДатаНачала, Знач ДатаОкончания) Экспорт

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Оплаты.Заказ КАК Заказ,
	|	СУММА(Оплаты.Сумма) КАК СуммаОплат
	|ПОМЕСТИТЬ ВТИтогиОплат
	|ИЗ
	|	Документ.Оплата КАК Оплаты
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.Заказ
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|ВЫБРАТЬ
	|	Заказы.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ИтогиОплат.СуммаОплат, 0) КАК СуммаОплат
	|ИЗ
	|	Документ.Заказ КАК Заказы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогиОплат КАК ИтогиОплат
	|		ПО Заказы.Ссылка = ИтогиОплат.Заказ
	|ГДЕ
	|	Заказы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
