Процедура ЗаполнитьОстаткиЗаказов(Знач ДокументОбъект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Остаток
	|ИЗ
	|	Документ.Заказ.Товары КАК Заказы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки() КАК Остатки
	|		ПО Заказы.Номенклатура = Остатки.Номенклатура
	|ГДЕ
	|	Заказы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл
		СтрокаЗаказа = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРезультата.Номенклатура))[0];
		СтрокаЗаказа.Остаток = СтрокаРезультата.Остаток;
	КонецЦикла;

КонецПроцедуры
