Процедура ЗаполнитьОстаткиЗаказов(Знач ДокументОбъект) Экспорт

	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст = "ВЫБРАТЬ Номенклатура ИЗ Документ.Заказ.Товары ГДЕ Ссылка = &Ссылка";
	ЗапросЗаказы.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Заказы = ЗапросЗаказы.Выполнить().Выгрузить();

	ЗапросОстатки = Новый Запрос;
	ЗапросОстатки.Текст = "ВЫБРАТЬ Номенклатура, КоличествоОстаток
	|ИЗ РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура В (&СписокНоменклатуры))";
	ЗапросОстатки.УстановитьПараметр("СписокНоменклатуры", Заказы.ВыгрузитьКолонку("Номенклатура"));
	Остатки = ЗапросОстатки.Выполнить().Выгрузить();

	Для Каждого СтрокаЗаказа Из Заказы Цикл
		Для Каждого СтрокаОстатка Из Остатки Цикл
			Если СтрокаОстатка.Номенклатура = СтрокаЗаказа.Номенклатура Тогда
				СтрокаЗаказа.Остаток = СтрокаОстатка.КоличествоОстаток;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
