Процедура ЗаполнитьСтавкуНДС(Знач СтрокаТоваров, Знач ОблагаетсяНДС, Знач СтранаПроисхождения) Экспорт

	// [qg not_verified: dimension=compilation, reason=no_platform]
	Если ОблагаетсяНДС Тогда
		СтрокаТоваров.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	Иначе
		СтрокаТоваров.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Учет.НДС", УровеньЖурналаРегистрации.Информация);

	Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		СтрокаТоваров.СтранаПроисхождения = СтранаПроисхождения;
	КонецЕсли;

КонецПроцедуры
