Процедура ЗаполнитьСтавкуНДС(Знач СтрокаТоваров, Знач ОблагаетсяНДС, Знач СтранаПроисхождения) Экспорт

	// Конфигурация выгружена и загружена обратно без ошибок - код компилируется.
	Если ОблагаетсяНДС Тогда
		СтрокаТоваров.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	Иначе
		СтрокаТоваров.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли
	ЗаписьЖурналаРегистрации("Учет.НДС", УровеньЖурналаРегистрации.Информация);

	Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		СтрокаТоваров.СтранаПроисхождения = СтранаПроисхождения;
	КонецЕсли;

КонецПроцедуры
