Функция ПолучитьИдентификаторЗаказа(Знач Ответ) Экспорт
	Возврат Ответ.Свойства.Получить("id");
КонецФункции

Функция ПолучитьДатуЗаказа(Знач Ответ) Экспорт
	Возврат XMLЗначение(Тип("Дата"), Ответ.Свойства.Получить("date"));
КонецФункции

Функция ПолучитьСуммуЗаказа(Знач Ответ) Экспорт
	Возврат XMLЗначение(Тип("Число"), Ответ.Свойства.Получить("amount"));
КонецФункции

Процедура ЗаполнитьДокументПоОтвету(Знач ДокументОбъект, Знач Ответ) Экспорт
	ДокументОбъект.НомерВнешний = ПолучитьИдентификаторЗаказа(Ответ);
	ДокументОбъект.Дата = ПолучитьДатуЗаказа(Ответ);
	ДокументОбъект.Сумма = ПолучитьСуммуЗаказа(Ответ);
КонецПроцедуры
