Процедура ЗарезервироватьТовар(Знач ДокументОбъект, Знач Номенклатура, Знач Количество) Экспорт

	Остаток = ПолучитьОстаток(Номенклатура, ДокументОбъект.Склад);
	Резервировать = Остаток;

	Если Резервировать > Количество Тогда
		Резервировать = Количество;
	КонецЕсли;

	НоваяСтрока = ДокументОбъект.Резервы.Добавить();
	НоваяСтрока.Номенклатура = Номенклатура;
	НоваяСтрока.Количество = Резервировать;
	НоваяСтрока.Остаток = Остаток;
	НоваяСтрока.Склад = ДокументОбъект.Склад;
	НоваяСтрока.ДатаРезерва = ТекущаяДата();

КонецПроцедуры
