Функция ЗаписиОчереди(Знач Среда, Знач УчитыватьСроки = Истина, Знач КлючЗаписи = Неопределено) Экспорт
	Отбор = Новый Структура("Среда, УчитыватьСроки, КлючЗаписи", Среда, УчитыватьСроки, КлючЗаписи);
	Возврат ПолучитьЗаписи(Отбор);
КонецФункции

Процедура ЗапуститьРегламентноеЗадание(Знач Среда) Экспорт
	Записи = ЗаписиОчереди(Среда);
КонецПроцедуры

Процедура ОбработатьФоновоеЗадание(Знач Среда) Экспорт
	Записи = ЗаписиОчереди(Среда);
КонецПроцедуры

Процедура КомандаФормыОбработать(Знач Среда, Знач КлючЗаписи) Экспорт
	Записи = ЗаписиОчереди(Среда, Истина, КлючЗаписи);
КонецПроцедуры
