Функция ПодобратьНоменклатуруПоАртикулам(Знач Артикулы) Экспорт

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Артикул",
		Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));

	Для Каждого Артикул Из Артикулы Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Артикул = Артикул;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ &Таблица КАК Артикулы
	|		ПО Номенклатура.Артикул = Артикулы.Артикул";
	Запрос.УстановитьПараметр("Таблица", Таблица);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
