Процедура ОбработатьЗаказы(Знач Заказы) Экспорт

	Для Каждого Заказ Из Заказы Цикл

		Если Не Заказ.Проведен Тогда
			Продолжить;
		КонецЕсли;

		Для Каждого Строка Из Заказ.Товары Цикл
			ОбработатьСтрокуЕслиНужно(Строка, Заказ.Склад);
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьСтрокуЕслиНужно(Знач Строка, Знач Склад) Экспорт

	Если Строка.Количество <= 0 Тогда
		Возврат;
	КонецЕсли;
	Если Не Строка.Резерв Тогда
		Возврат;
	КонецЕсли;
	Если Строка.Склад <> Склад Тогда
		Возврат;
	КонецЕсли;

	ОбработатьСтроку(Строка);

КонецПроцедуры
